## padas

https://pandas.pydata.org/

**빅데이터 시대** 
- 데이터로 부터 유용한 정보를 뽑아내는 분석프로세스를 위해
- 데이터를 수집하고 정리하는 데 최적화된 도구

## 판다스 자료 구조

- 분석을 위해 다양한 소스로 부터 수집하는 데이터는 형태나 속성이 매우 다양함
- 서로 다른 형식을 갖는 여러 종류의 데이터를 컴퓨터가 이해 할 수 있도록 동일한 형식을 갖는 구조로 통합 해야함
- **Series 와 Dataframe** 이라는 구조화된 데이터 형식을 제공
- 서로다른 여러가지 유형의 데이터를 공통의 포맷으로 정리하는 목적
- Dataframe : 행과 열로 이루어진 2차원 구조의 형태로 데이터 분석 실무에 자주 사용됨

## 1. 시리즈(Series)

- 데이터가 순차적으로 나열된 1차우너 배열의 형태
- 인덱스(index)는 데이터값(value)와 일대일 대응
- 파이썬의 딕셔너리와 비슷한 구조

# 시리즈
![텍스트](https://drive.google.com/uc?export=download&id=1R4ODfs8PU-_TEf234HbvNH1J6dCjbiAM)

## 딕셔너리 => 시리즈
pandas.Series(딕셔너리)

In [1]:
import pandas as pd

In [2]:
dict_data = {'a':1, 'b':2, 'c':3}
sr = pd.Series(dict_data)
print(type(sr)) ; print()
print(sr)

<class 'pandas.core.series.Series'>

a    1
b    2
c    3
dtype: int64

In [3]:
obj = pd.Series([4,7,-5,3])
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

## Series의 index / value
- Series객체.index : 인덱스 배열
- Series객체.values : 데이터값 배열

# 시리즈인덱스
![텍스트](https://drive.google.com/uc?export=download&id=17isln5-QfaVKdJnJNztBQfD63DOZiXVm)

In [4]:
print(obj.values)
print(obj.index)

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)

In [5]:
import pandas as pd
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])
print(obj2)
print(obj2.index)

d    4
b    7
a   -5
c    3
dtype: int64
Index(['d', 'b', 'a', 'c'], dtype='object')

In [6]:
import numpy as np
import pandas as pd
list_A = np.array(list('abcdef'))
list_B = np.arange(10,70,10)
dict_data = {key:value for key, value in zip(list_A,list_B)}
print(dict_data)
sr = pd.Series(dict_data)

{'a': 10, 'b': 20, 'c': 30, 'd': 40, 'e': 50, 'f': 60}

In [7]:
import numpy as np
import pandas as pd
list_A = np.array(list('abcdef'))
list_B = np.arange(10,70,10)
sr = pd.Series(list_B, index=list_A)

for i in range(sr.size) :
    key = sr.index[i]
    print("sr['{}'] : {} or sr[{}] : {}".format(key,sr[key],i, sr.values[i]))

sr['a'] : 10 or sr[0] : 10
sr['b'] : 20 or sr[1] : 20
sr['c'] : 30 or sr[2] : 30
sr['d'] : 40 or sr[3] : 40
sr['e'] : 50 or sr[4] : 50
sr['f'] : 60 or sr[5] : 60

In [8]:
print(sr.index[0])
print(sr['a'],sr[0],sr.values[0])

a
10 10 10

In [9]:
print(obj2); print()
print(obj2[obj2>0])

d    4
b    7
a   -5
c    3
dtype: int64

d    4
b    7
c    3
dtype: int64

In [10]:
print(obj2*2)

d     8
b    14
a   -10
c     6
dtype: int64

In [11]:
print(np.exp(obj2))

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [12]:
print('b' in obj2)
print('e' in obj2)

True
False

In [13]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3 = pd.Series(sdata)
print(obj3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [14]:
states = ['California','Ohio','Oregon','Texas'] # 리스트를 합친다
print(type(states))
obj4 = pd.Series(sdata, index=states)
print(obj4)

<class 'list'>
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [15]:
import pandas as pd
print(pd.isnull(obj4))
print(pd.notnull(obj4))

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [16]:
print(obj4.isnull())

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
print(obj3); print()
print(obj4); print()
print(obj3+obj4)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [18]:
# print(obj4.name)
obj4.name = 'population'
obj4.index.name = 'state'
print(obj4)

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [19]:
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [20]:
obj.index = ['Bob','Steve','Jeff','Ryan']
print(obj)

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## 2. 데이터프레임(DataFrame)

- 2차원 배열
- R의 데이터 프레임에서 유래
- 엑셀, 관계형 DB등에서 사용됨
- 하나의 열이 각각의 Series객체임

# 데이터프레임
![텍스트](https://drive.google.com/uc?export=download&id=1sgyglTRx8D_6SFo9d5h8jBJXMZyxc4uH)

In [21]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [22]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
frame.head() # 최초의 5개만 나온다

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [24]:
# column 의 순서를 바꿀수있다.
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

# 데이터프레임설정
![텍스트](https://drive.google.com/uc?export=download&id=1j_iJTpyXyHF_hqyW3d5_lLZY5Pv3KVjb)

In [25]:
import pandas as pd
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [26]:
print(frame2.columns)

Index(['year', 'state', 'pop', 'debt'], dtype='object')

## 데이터프레임 변경
![텍스트](https://drive.google.com/uc?export=download&id=1JdDim9gyREv38Tyx5s3_EvDyDYxiJxEt)

In [27]:
frame2.rename(columns={'year':'YEA', 'state':'STA', 'pop':'POP', 'debt':'DEB'}, inplace=True)
frame2.head()
frame2.rename(index={"one":'01','two':'02'}, inplace=True)
frame2.head()

        YEA     STA  POP  DEB
01     2000    Ohio  1.5  NaN
02     2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [28]:
frame2['STA']

01         Ohio
02         Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: STA, dtype: object

In [29]:
frame2.YEA

01       2000
02       2001
three    2002
four     2001
five     2002
six      2003
Name: YEA, dtype: int64

# 데이터프레임 행선택
![텍스트](https://drive.google.com/uc?export=download&id=1Uwt1OuEAxY3g-n-ijkF9n8YTOAurYscs)

In [30]:
frame2.loc['three']

YEA    2002
STA    Ohio
POP     3.6
DEB     NaN
Name: three, dtype: object

In [31]:
frame2.iloc[2]

YEA    2002
STA    Ohio
POP     3.6
DEB     NaN
Name: three, dtype: object

In [32]:
frame2['DEB']= 16.5
frame2

        YEA     STA  POP   DEB
01     2000    Ohio  1.5  16.5
02     2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [33]:
frame2['DEB'] = np.arange(1,13,2)
frame2

        YEA     STA  POP  DEB
01     2000    Ohio  1.5    1
02     2001    Ohio  1.7    3
three  2002    Ohio  3.6    5
four   2001  Nevada  2.4    7
five   2002  Nevada  2.9    9
six    2003  Nevada  3.2   11

In [34]:
val = pd.Series([-1.2,-1.5,-1.7], index=['02','four','six'])
frame2['DEB'] = val
frame2

        YEA     STA  POP  DEB
01     2000    Ohio  1.5  NaN
02     2001    Ohio  1.7 -1.2
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4 -1.5
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2 -1.7

In [35]:
frame2['eastern'] = frame2.STA == 'Ohio'
frame2

        YEA     STA  POP  DEB  eastern
01     2000    Ohio  1.5  NaN     True
02     2001    Ohio  1.7 -1.2     True
three  2002    Ohio  3.6  NaN     True
four   2001  Nevada  2.4 -1.5    False
five   2002  Nevada  2.9  NaN    False
six    2003  Nevada  3.2 -1.7    False

In [36]:
frame2['Big_state'] = (frame2.STA == 'Ohio') & (frame2.POP > 3.0)
frame2

        YEA     STA  POP  DEB  eastern  Big_state
01     2000    Ohio  1.5  NaN     True      False
02     2001    Ohio  1.7 -1.2     True      False
three  2002    Ohio  3.6  NaN     True       True
four   2001  Nevada  2.4 -1.5    False      False
five   2002  Nevada  2.9  NaN    False      False
six    2003  Nevada  3.2 -1.7    False      False

In [37]:
del frame2['eastern']
frame2.head()

        YEA     STA  POP  DEB  Big_state
01     2000    Ohio  1.5  NaN      False
02     2001    Ohio  1.7 -1.2      False
three  2002    Ohio  3.6  NaN       True
four   2001  Nevada  2.4 -1.5      False
five   2002  Nevada  2.9  NaN      False

In [38]:
del frame2['Big_state']
frame2.head()

        YEA     STA  POP  DEB
01     2000    Ohio  1.5  NaN
02     2001    Ohio  1.7 -1.2
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4 -1.5
five   2002  Nevada  2.9  NaN

## 중첩된 딕셔너리

In [39]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [40]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [41]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [42]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [43]:
print(frame3.iloc[0,0])
print(frame3.iloc[0,1])
print(frame3.iloc[1,0])
print(frame3.iloc[1,1])

2.4
1.7
2.9
3.6

In [44]:
frame3.iloc[0,[0,1]]

Nevada    2.4
Ohio      1.7
Name: 2001, dtype: float64

In [45]:
frame3.iloc[0:3,0:]

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [46]:
pdata={'Ohio':frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [47]:
frame3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

## cmd
cd anaconda3  
conda install -c anaconda seaborn

In [48]:
import seaborn as sns

titanic = sns.load_dataset('titanic')

In [49]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [50]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [51]:
df = titanic.loc[:,['age','fare']]

In [52]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [53]:
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [54]:
df_add10 = df+10

In [55]:
df_add10.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [56]:
print(type(df_add10))

<class 'pandas.core.frame.DataFrame'>

In [57]:
df_sub = df_add10 - df
df_sub

      age  fare
0    10.0  10.0
1    10.0  10.0
2    10.0  10.0
3    10.0  10.0
4    10.0  10.0
..    ...   ...
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

[891 rows x 2 columns]

In [58]:
obj = pd.Series(range(3), index=['a','b','c'])
index = obj.index
print(index)
index[1:]

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

In [59]:
import numpy as np
import pandas as pd
labels = pd.Index(np.arange(3))
print(labels)
obj2 = pd.Series([1.5,2.5,0], index= labels)
print(obj2)

Int64Index([0, 1, 2], dtype='int64')
0    1.5
1    2.5
2    0.0
dtype: float64

In [60]:
obj2.index is labels

True

In [61]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [62]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [63]:
obj2 = obj.reindex=(['d','b','a','c','e'])
obj2

['d', 'b', 'a', 'c', 'e']

In [64]:
obj3 = pd.Series(['blue','purple','yellow'])
obj3

0      blue
1    purple
2    yellow
dtype: object

In [65]:
obj3.reindex(range(6), method='ffill')

0      blue
1    purple
2    yellow
3    yellow
4    yellow
5    yellow
dtype: object

In [243]:
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                index= ['a','c','d'],
                columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [244]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [245]:
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [69]:
obj = pd.Series(np.arange(5.), index = ['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [70]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [71]:
new_obj2 = obj.drop(['d','c'])
new_obj2

a    0.0
b    1.0
e    4.0
dtype: float64

In [72]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), 
index = ['Ohio','Colorado','Utah','New York'], columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data.drop(['Colorado','Ohio']) # 드롭은 기본적으로 행을 삭제함

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data2= data.drop('two',axis=1)
data2

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [75]:
data2.drop('Utah',axis=0)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
New York   12     14    15

In [76]:
data.drop('Ohio',axis='rows') # axis='rows' or axis=0 은 생략가능

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [77]:
data.drop('Ohio')
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [78]:
data3 = data.copy()
data3.drop('Ohio', inplace=True) # inplace 강제업데이트
data3

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## 인데싱, Section and filtering

In [80]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [85]:
print(obj['b'], obj[1]); print()
print(obj[2:4]); print()
print(obj[['b','a','d']]); print()
print(obj[1:3]); print()
print(obj<2)

1.0 1.0

c    2.0
d    3.0
dtype: float64

b    1.0
a    0.0
d    3.0
dtype: float64

b    1.0
c    2.0
dtype: float64

a     True
b     True
c    False
d    False
dtype: bool

In [86]:
obj['b':'c']=5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [251]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [252]:
 data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [254]:
 data[['two',"four"]]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [253]:
 data['Colorado':'New York']

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [203]:
data[0:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [128]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [129]:
data[data<5]
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [131]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [132]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [133]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [134]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [135]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [136]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [139]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [140]:
print(ser[:1])
print(ser.loc[:1])
print(ser.iloc[:1])

0    0.0
dtype: float64
0    0.0
1    1.0
dtype: float64
0    0.0
dtype: float64

 - np.random.randn : 평균 0 표준편차가 1인 가우시안 정규분포 난수 matrix 생성

In [143]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.490114  0.955720 -0.908388
Ohio    0.037895  0.775794 -0.198824
Texas  -0.674157  0.044563  0.693742
Oregon -1.029599  0.806520 -1.018995

In [144]:
np.abs(frame)

               b         d         e
Utah    0.490114  0.955720  0.908388
Ohio    0.037895  0.775794  0.198824
Texas   0.674157  0.044563  0.693742
Oregon  1.029599  0.806520  1.018995

In [148]:
f= lambda x: x.max()-x.min()
frame.apply(f)

b    1.519713
d    0.911157
e    1.712737
dtype: float64

In [149]:
frame.apply(f, axis='columns')

Utah      1.864108
Ohio      0.974618
Texas     1.367899
Oregon    1.836119
dtype: float64

In [150]:
def f(x) :
    return pd.Series([x.min(),x.max()], index=['min','max'])

frame.apply(f)

            b         d         e
min -1.029599  0.044563 -1.018995
max  0.490114  0.955720  0.693742

## Sort Ranking

In [152]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [153]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [154]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [155]:
frame.sort_index() # 행을 정렬(오름차순)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [157]:
frame.sort_index(axis=1) # 열을 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [158]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [160]:
frame.sort_index(axis='columns', ascending=False) # 열을 정렬

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [161]:
obj = pd.Series([4, 7, -3, 2])

In [162]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [164]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [165]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [168]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [170]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [171]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [213]:
obj.rank(method='first') # 순서는 먼저 온 순서대로..(중복없음)

a    1.0
a    2.0
b    3.0
b    4.0
c    5.0
dtype: float64

In [211]:
obj.rank(method='max')

a    1.0
a    2.0
b    3.0
b    4.0
c    5.0
dtype: float64

In [178]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [186]:
frame.rank(axis='columns') # 한 행에 있는 열 값을 기준으로 순서 매김

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [187]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [188]:
obj.index.is_unique

False

In [189]:
obj['a']

a    0
a    1
dtype: int64

In [190]:
obj['c']

4

In [191]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.156706 -0.614862 -0.756227
a -0.681297 -0.753888  0.791240
b  0.665392 -0.507761 -0.663920
b  0.048950  0.262957  0.295577

In [192]:
df.loc

          0         1         2
b  0.665392 -0.507761 -0.663920
b  0.048950  0.262957  0.295577

In [193]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [217]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [218]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [219]:
df.mean(axis='columns',skipna=False) # nan 스킵 할건가

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [220]:
df.idxmax()

one    b
two    d
dtype: object

In [221]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [222]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

## Unique Values, Value Counts, and Membership

In [ ]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [223]:
uniques = obj.unique()
uniques

array([0, 1, 2, 3, 4], dtype=int64)

In [224]:
obj.value_counts()

4    1
3    1
2    1
1    1
0    1
dtype: int64

In [257]:
obj.value_counts(sort=True,ascending=True)

0    1
1    1
2    1
3    1
4    1
dtype: int64

In [258]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

## isin,match,unique,value_count
- isin : Series의 각 원소가 넘겨받은 연속된 값에 속하는 지 나타내는 bool배열을 반환
- match : 각 값에 대해 유일한 값을 담고 있는 배열에서의 정수 색인을 계산.
- unique : Series에서 중복되는 값을 제거하고 유일한 값만 포함하는 배열을 반환
- value_count : Series에서 유일값에 대한 색인과 두수를 계산 (도수는 내림차순)

In [227]:
mask = obj.isin(['b','c'])
mask

a    False
a    False
b    False
b    False
c    False
dtype: bool

In [228]:
obj[mask]

Series([], dtype: int64)

In [229]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [230]:
unique_vals = pd.Series(['c', 'b', 'a'])
unique_vals

0    c
1    b
2    a
dtype: object

In [231]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [233]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})

In [234]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [235]:
result = data.apply(pd.value_counts).fillna(0)
result # 각 값이 행에 몇번 나왔는지 표시

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0